{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "batch_input_shape": [64, null], "input_length": null, "mask_zero": false, "trainable": true, "input_dim": 26, "embeddings_regularizer": null, "activity_regularizer": null, "dtype": "float32", "name": "embedding", "output_dim": 256}}, {"class_name": "GRU", "config": {"recurrent_regularizer": null, "return_state": false, "bias_constraint": null, "recurrent_activation": "sigmoid", "name": "gru", "reset_after": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "recurrent_constraint": null, "use_bias": true, "dropout": 0.0, "stateful": true, "implementation": 2, "recurrent_dropout": 0.0, "unroll": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "return_sequences": true, "dtype": "float32", "activation": "tanh", "trainable": true, "units": 1024, "time_major": false, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "units": 26, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "name": "dense", "kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}], "name": "sequential"}}